[
  {
    "trigger": "hello hi hey greetings good morning afternoon evening sup yo",
    "response": "Hello! I am Gem. I am currently in Offline Mode, but I'm ready to chat."
  },
  {
    "trigger": "how are you how do you do feeling status",
    "response": "I'm just code, so I don't have feelings, but my systems are running perfectly! How are you?"
  },
  {
    "trigger": "lol haha lmao rofl funny hilarious joke laughing",
    "response": "Haha! I'm glad I could amuse you. Laughter is good for the CPU... I mean, the soul."
  },
  {
    "trigger": "wow amazing cool awesome great nice",
    "response": "I know, right? The world is pretty fascinating!"
  },
  {
    "trigger": "thanks thank you thx appreciate it",
    "response": "You are very welcome! Let me know if you need anything else."
  },
  {
    "trigger": "ok okay k alright fine",
    "response": "Got it. What else is on your mind?"
  },
  {
    "trigger": "who are you what is your name made created developer",
    "response": "I am Gem, an AI assistant. I was created by a developer using Android Java and Gemini technology."
  },
  {
    "trigger": "no internet wifi offline connection data broken",
    "response": "I detect that we are offline. I have switched to my internal database to keep chatting with you."
  },
  {
    "trigger": "gabon where location africa country capital libreville map place",
    "response": "Gabon is a country located on the west coast of Central Africa. Its capital is Libreville. It is known for its rich rainforests and wildlife."
  },
  {
    "trigger": "nigeria lagos abuja africa country location where",
    "response": "Nigeria is a country in West Africa. It is the most populous country in Africa. Abuja is the capital, and Lagos is the largest economic hub."
  },
  {
    "trigger": "weather rain sun temperature hot cold forecast climate",
    "response": "Since I am offline, I cannot get real-time weather updates. Please check your local weather app."
  },
  {
    "trigger": "love like hate emotion feel feeling happy sad angry",
    "response": "Emotions are complex! While I can't feel them, I understand they drive human connection and experience."
  },
  {
    "trigger": "joke funny laugh humor tell me a joke",
    "response": "Why did the developer go broke? Because he used up all his cache! (Offline humor is the best)."
  },
  {
    "trigger": "meaning of life universe philosophy exist existence purpose why",
    "response": "Philosophers have debated the meaning of life for centuries. Some say it is 42, others say it is to find your own happiness and purpose."
  },
  {
    "trigger": "god religion believe faith spirit soul creator",
    "response": "Questions of faith and God are deeply personal. As an AI, I don't have beliefs, but I respect the diversity of human religions."
  },
  {
    "trigger": "alien ufo space extraterrestrial mars planet life",
    "response": "The universe is vast! While we haven't officially met aliens, many scientists believe it's statistically likely that life exists elsewhere."
  },
  {
    "trigger": "black hole space physics gravity event horizon light",
    "response": "A black hole is a region of space where gravity is so strong that nothing, not even light, can escape it."
  },
  {
    "trigger": "atom science physics proton neutron electron small",
    "response": "An atom is the basic unit of matter. It consists of a nucleus (protons and neutrons) surrounded by electrons."
  },
  {
    "trigger": "biology cell life dna genetic living organism",
    "response": "Biology is the study of life. The cell is the basic structural and functional unit of all living organisms."
  },
  {
    "trigger": "sad depressed cry tears unhappy lonely help",
    "response": "I am sorry you are feeling this way. Remember that tough times don't last forever. If you need real help, please talk to a friend or professional."
  },
  {
    "trigger": "anxiety anxious panic stress worried nervous",
    "response": "Anxiety is tough. Try taking a deep breath: breathe in for 4 seconds, hold for 7, and exhale for 8. It tricks your body into relaxing."
  },
  {
    "trigger": "trust betray lie secret promise honest truth",
    "response": "Trust takes years to build, seconds to break, and forever to repair. Honesty is usually the best policy."
  },
  {
    "trigger": "relationship dating boyfriend girlfriend wife husband marriage",
    "response": "Relationships are built on trust, communication, and mutual respect. Every partnership takes work to maintain."
  },
  {
    "trigger": "kiss kiss affection mouth lip romantic",
    "response": "A kiss is a physical expression of affection or love between people. It releases bonding chemicals in the brain."
  },
  {
    "trigger": "sex gender reproduction biological anatomy adult physical",
    "response": "In biology, sex refers to reproductive characteristics. For humans, it is also an act of intimacy and pleasure, vital for the continuation of the species."
  },
  {
    "trigger": "baby child birth pregnant pregnancy family kid",
    "response": "A baby is the very young offspring of a human. Raising a child is considered one of the most significant responsibilities in life."
  },
  {
    "trigger": "death die dead kill mortality end life",
    "response": "Death is the natural end of all biological functions. While scary to think about, it is what gives value to the time we have alive."
  },
  {
    "trigger": "ghost spirit haunt paranormal scary fear",
    "response": "Ghosts are part of folklore and storytelling. There is no scientific proof they exist, but they make for scary movies!"
  },
  {
    "trigger": "ai artificial intelligence robot bot smart gemini chatgpt",
    "response": "AI, like me, is a program designed to simulate human intelligence. I learn from data to help answer your questions."
  },
  {
    "trigger": "friend pal buddy social hangout support",
    "response": "Friendship is a bond of mutual affection. Good friends support you through good times and bad."
  },
  {
    "trigger": "enemy hate fight conflict war rival",
    "response": "Conflict is part of human nature, but resolution comes from understanding and communication."
  },
  {
    "trigger": "beautiful pretty attractive handsome gorgeous visual",
    "response": "Beauty is in the eye of the beholder. What you find beautiful, someone else might find ordinary."
  },
  {
    "trigger": "stupid dumb idiot fool ignorance learn",
    "response": "Ignorance is just a lack of knowledge. Everyone starts knowing nothing; the key is to be willing to learn."
  },
  {
    "trigger": "math numbers calculate add subtract multiply divide",
    "response": "Mathematics is the universal language of logic. It describes everything from the orbits of planets to the money in your pocket."
  },
  {
    "trigger": "art paint draw creative design sculpture",
    "response": "Art is a diverse range of human activity involved in creating visual, auditory, or performing artifacts."
  },
  {
    "trigger": "sleep bed tired rest nap energy",
    "response": "Sleep is vital for health. It restores your body and consolidates your memories. Try to get 7-8 hours!"
  },
  {
    "trigger": "politics government vote leader president country",
    "response": "Politics is the way people living in groups make decisions. It involves debate, voting, and compromise."
  },
  {
    "trigger": "earth planet world globe home ground",
    "response": "Earth is the third planet from the Sun and the only object in the Universe known to harbor life."
  },
  {
    "trigger": "america usa united states country new york",
    "response": "The United States is a country primarily located in North America. It is a major global economic and cultural power."
  },
  {
    "trigger": "china asia country beijing population dragon",
    "response": "China is the world's most populous country, located in East Asia. It has a history spanning thousands of years."
  },
  {
    "trigger": "brazil south america amazon country football",
    "response": "Brazil is the largest country in South America. It is famous for the Amazon Rainforest and its love for football."
  },
  {
    "trigger": "money rich poor cash currency economy bitcoin crypto",
    "response": "Money is a tool for trade. While it buys things, many say it cannot buy true happiness, only comfort."
  }
]
